#+latex_class: dissertation
#+latex_class_options: [12pt,a4paper,twoside]
#+latex_header: \usepackage[hyperref=true,url=true,backend=biber,natbib=true]{biblatex}
#+latex_header: \usepackage[vmargin=2cm,hmargin=1in]{geometry}
#+latex_header: \usepackage[chapter]{minted}
#+latex_header: \usepackage[binary-units]{siunitx}
#+latex_header: \usepackage{booktabs,ebproof,parskip,standalone,stmaryrd,syntax}
#+latex_header: \addbibresource{diss.bib}

# math operators
#+latex_header: \DeclareMathOperator{\True}{true}
#+latex_header: \DeclareMathOperator{\False}{false}
#+latex_header: \DeclareMathOperator{\If}{if}
#+latex_header: \DeclareMathOperator{\Then}{then}
#+latex_header: \DeclareMathOperator{\Else}{else}
#+latex_header: \DeclareMathOperator{\Let}{let}
#+latex_header: \DeclareMathOperator{\In}{in}
#+latex_header: \DeclareMathOperator{\Null}{null}
#+latex_header: \DeclareMathOperator{\First}{first}
#+latex_header: \DeclareMathOperator{\Flast}{flast}

# shorthand
#+latex_header: \newcommand\mre{\(\mu\)-regular expression}
#+latex_header: \newcommand\mres{\(\mu\)-regular expressions}
#+latex_header: \newcommand\ky{KY}
#+latex_header: \newcommand\hm{Hindley-Milner}
#+latex_header: \newcommand\debruijn{De~Bruijn}

# try to avoid widows and orphans
#+latex_header: \raggedbottom
#+latex_header: \sloppy
#+latex_header: \clubpenalty1000%
#+latex_header: \widowpenalty1000%

# Other options
#+options: toc:nil H:6

# Word count
#+name: word-count
#+begin_src shell :exports none
  tmp="$(mktemp)"
  sed -e '/begin{minted}/,/end{minted}/d' diss.tex >"$tmp"
  texcount -sum -1 "$tmp"
  rm "$tmp"
#+end_src

#+RESULTS: word-count
: 11062

#+begin_src emacs-lisp :exports none
  (defun tables-recalc (backend)
    (org-table-recalculate-buffer-tables))

  (add-hook 'org-export-before-processing-hook #'tables-recalc)
#+end_src

#+RESULTS:
| tables-recalc |

#+latex: %TC:ignore
# ##############################################################################
# Title
\pagestyle{empty}
\rightline{\LARGE\bf Greg Brown}

\vspace*{60mm}
\begin{center}
\Huge
{\bf A Typed, Algebraic Parser Generator} \\[5mm]
Computer Science Tripos -- Part II \\[5mm]
Queens' College \\[5mm]
\today
\end{center}
  
# ##############################################################################
# Declaration of Originality 
\pagebreak{}

